Terraform Plan:

https://github.com/connormaglynn/infrastructure/pull/42/checks#step:5:1

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/connormaglynn/github/runs/run-4dHh3Qzfeha4ha87

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
github_repository.repositories["developer-navigation-browser-plugin"]: Refreshing state... [id=developer-navigation-browser-plugin]
github_repository.repositories["tillysofcastleton.com"]: Refreshing state... [id=tillysofcastleton.com]
github_repository.repositories["gemsbook-keeping.co.uk"]: Refreshing state... [id=gemsbook-keeping.co.uk]
github_repository.repositories["learning-golang"]: Refreshing state... [id=learning-golang]
github_repository.repositories["garrettys.com"]: Refreshing state... [id=garrettys.com]
github_repository.repositories["scripts"]: Refreshing state... [id=scripts]
github_repository.repositories["advent-of-code-typescript"]: Refreshing state... [id=advent-of-code-typescript]
github_repository.repositories["shopping-cart-typescript"]: Refreshing state... [id=shopping-cart-typescript]
github_repository.repositories["firebase-playground"]: Refreshing state... [id=firebase-playground]
github_repository.repositories["connorglynn.com"]: Refreshing state... [id=connorglynn.com]
github_repository.repositories["typescript-template"]: Refreshing state... [id=typescript-template]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["imust-cli"]: Refreshing state... [id=imust-cli]
github_repository.repositories["learning-python"]: Refreshing state... [id=learning-python]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.repositories["advent-of-code-typescript"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "advent-of-code-typescript"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "advent-of-code-typescript"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repositories["connorglynn.com"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "connorglynn.com"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "connorglynn.com"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repositories["developer-navigation-browser-plugin"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "developer-navigation-browser-plugin"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "developer-navigation-browser-plugin"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["firebase-playground"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "firebase-playground"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "firebase-playground"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["garrettys.com"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "garrettys.com"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "garrettys.com"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repositories["gemsbook-keeping.co.uk"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "gemsbook-keeping.co.uk"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "gemsbook-keeping.co.uk"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repositories["imust-cli"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "imust-cli"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "imust-cli"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["infrastructure"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "infrastructure"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "infrastructure"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["learning-golang"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "learning-golang"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "learning-golang"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["learning-python"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "learning-python"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "learning-python"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["projects"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "This repository is managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "projects"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + web_commit_signoff_required = false
    }

  # github_repository.repositories["scripts"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "scripts"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "scripts"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["shopping-cart-typescript"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "shopping-cart-typescript"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "shopping-cart-typescript"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repositories["tillysofcastleton.com"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "tillysofcastleton.com"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "tillysofcastleton.com"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repositories["typescript-template"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "typescript-template"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "typescript-template"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + web_commit_signoff_required = false
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 14 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 15 estimated
           $0.0/mo +$0.0

```